# Q1. List any five functions of the pandas library with execution.

Here are five common functions of the pandas library in Python along with example executions:

1. read_csv(): This function is used to read data from a CSV file and create a pandas DataFrame.

In [1]:
import pandas as pd

# Example execution
df = pd.read_csv('players_data.csv')
df.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035

2. info(): This function provides information about a DataFrame, including the data types, non-null values, and memory usage.

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 675 entries, 0 to 674
Data columns (total 30 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rk      675 non-null    object
 1   Player  675 non-null    object
 2   Pos     675 non-null    object
 3   Age     675 non-null    object
 4   Tm      675 non-null    object
 5   G       675 non-null    object
 6   GS      675 non-null    object
 7   MP      675 non-null    object
 8   FG      675 non-null    object
 9   FGA     675 non-null    object
 10  FG%     673 non-null    object
 11  3P      675 non-null    object
 12  3PA     675 non-null    object
 13  3P%     594 non-null    object
 14  2P      675 non-null    object
 15  2PA     675 non-null    object
 16  2P%     671 non-null    object
 17  eFG%    673 non-null    object
 18  FT      675 non-null    object
 19  FTA     675 non-null    object
 20  FT%     650 non-null    object
 21  ORB     675 non-null    object
 22  DRB     675 non-null    object
 23  TRB     675 non-null    object
 24  AST     675 non-null    object
 25  STL     675 non-null    object
 26  BLK     675 non-null    object
 27  TOV     675 non-null    object
 28  PF      675 non-null    object
 29  PTS     675 non-null    object
dtypes: object(30)
memory usage: 158.3+ KB

3. describe(): This function provides basic statistical summary of a DataFrame, including count, mean, standard deviation, minimum, and maximum values.

In [3]:
df.describe()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
count,675,675,675,675,675,675,675,675,675,675,...,650,675,675,675,675,675,675,675,675,675
unique,493,493,12,21,32,84,81,557,327,458,...,275,165,293,350,249,119,98,177,214,463
top,Rk,Player,SG,23,TOT,82,0,MP,FG,FGA,...,.500,1,DRB,TRB,AST,0,0,TOV,PF,PTS
freq,24,24,143,86,76,27,179,24,24,24,...,29,30,24,24,24,29,88,24,24,24

4. groupby(): This function is used to group data in a DataFrame based on one or more columns, and apply various aggregation functions on the groups.
Suppose we have a dataset of sales data for a company, and we want to analyze the total sales revenue and average sales quantity for each product category. The dataset looks like this:

In [4]:
# Create a sample DataFrame
data = {'Product Category': ['Electronics', 'Clothing', 'Furniture', 'Electronics', 'Clothing', 'Furniture'],
        'Product Name': ['TV', 'T-Shirt', 'Chair', 'Laptop', 'Shoes', 'Table'],
        'Sales Revenue': [1000, 500, 300, 1500, 700, 400],
        'Sales Quantity': [10, 5, 3, 12, 7, 4]}
df1 = pd.DataFrame(data)
df1

  Product Category Product Name  Sales Revenue  Sales Quantity
0      Electronics           TV           1000              10
1         Clothing      T-Shirt            500               5
2        Furniture        Chair            300               3
3      Electronics       Laptop           1500              12
4         Clothing        Shoes            700               7
5        Furniture        Table            400               4

In [5]:
grouped = df1.groupby('Product Category').agg({'Sales Revenue' : 'mean' ,'Sales Quantity':'sum'})
grouped

                  Sales Revenue  Sales Quantity
Product Category
Clothing                  600.0              12
Electronics              1250.0              22
Furniture                 350.0               7

5. drop(): This function is used to remove rows or columns from a DataFrame.

In [6]:
df1.drop('Product Name',axis=1,inplace=True)

In [7]:
df1

  Product Category  Sales Revenue  Sales Quantity
0      Electronics           1000              10
1         Clothing            500               5
2        Furniture            300               3
3      Electronics           1500              12
4         Clothing            700               7
5        Furniture            400               4

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
df2 = pd.DataFrame({'A' : [1,2,3],
              'B' : [4,5,6],
              'C' : [7,8,9]})

In [9]:
df2

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
def reindex_df(df2):
   
    # Set the new index starting from 1 and incrementing by 2
    df2.index = range(1, len(df2)* 2, 2)                                             

    return df2

df_reindexed = reindex_df(df2)
df_reindexed

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [11]:
df3 = pd.DataFrame({"Values" : [10, 20, 30, 40, 50] })

In [12]:
df3

   Values
0      10
1      20
2      30
3      40
4      50

In [13]:
df3['Values'].head(3).sum()

60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [14]:
data = {'Text' : ['Write a python fun' , 'create a new column word count' , 'contains the number of words']}
df4 = pd.DataFrame(data)

In [15]:
df4

                             Text
0              Write a python fun
1  create a new column word count
2    contains the number of words

In [16]:
df4['Word_Count'] = df4['Text'].apply(lambda x : len(x.split()))

In [17]:
df4

                             Text  Word_Count
0              Write a python fun           4
1  create a new column word count           6
2    contains the number of words           5

# Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() and DataFrame.shape are both methods in Pandas that provide information about the size or dimensions of a DataFrame, but they are used for different purposes and provide different outputs.

Here are the differences between DataFrame.size() and DataFrame.shape:

1. Output:

DataFrame.size(): Returns a single integer value representing the total number of elements in the DataFrame, i.e., the product of the number of rows and the number of columns.

DataFrame.shape: Returns a tuple representing the dimensions of the DataFrame in the form (rows, columns), where rows is the number of rows and columns is the number of columns.


2. Usage:

DataFrame.size(): Typically used to get the total number of elements in a DataFrame, regardless of the number of dimensions.

DataFrame.shape: Typically used to get the dimensions (number of rows and columns) of a DataFrame, which can be useful for data analysis and manipulation.
Here's an example to illustrate the differences:

In [18]:
data = {'A': [1, 2, 3],
        'B': [4, 5, 6],
        'C': [7, 8, 9]}
df5 = pd.DataFrame(data)

# DataFrame size
size = df5.size
print("DataFrame size: ", size)  

# DataFrame shape
shape = df5.shape
print("DataFrame shape: ", shape)

DataFrame size:  9
DataFrame shape:  (3, 3)

# Q6. Which function of pandas do we use to read an excel file?

In [19]:
df6 = pd.read_excel('LUSID Excel - Setting up your market data.xlsx')

In [20]:
df6.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [21]:
# Example DataFrame
data = {'Email': ['user1@example.com', 'user2@example.com', 'user3@example.com']}
df7 = pd.DataFrame(data)
df7

               Email
0  user1@example.com
1  user2@example.com
2  user3@example.com

In [22]:
df7['Username'] = df7['Email'].str.split('@').str[0]

In [23]:
df7

               Email Username
0  user1@example.com    user1
1  user2@example.com    user2
2  user3@example.com    user3

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [24]:
data = {"A" : [3,8,6,2,9] ,
       "B" : [5,2,9,3,1] ,
       "C" :  [1,7,4,5,2]}
df8 = pd.DataFrame(data)

In [25]:
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [26]:

def select_rows(df):
   
    # Filter the DataFrame based on the conditions
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]

    return selected_rows

In [27]:
selected_df = select_rows(df8)
selected_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [28]:
df9 = pd.DataFrame({'Values' : [8,5,4,9,6]})

In [29]:
df9['Values'].mean()

6.4

In [30]:
df9['Values'].median()

6.0

In [31]:
df9['Values'].mode()

0    4
1    5
2    6
3    8
4    9
Name: Values, dtype: int64

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [32]:
df9 = pd.DataFrame({"Date": pd.date_range(start='2022-01-01',end='2022-01-10') ,
                   "Sales" : [100, 150, 200, 180, 250, 300, 350, 400, 450, 500]})

In [33]:
df9

        Date  Sales
0 2022-01-01    100
1 2022-01-02    150
2 2022-01-03    200
3 2022-01-04    180
4 2022-01-05    250
5 2022-01-06    300
6 2022-01-07    350
7 2022-01-08    400
8 2022-01-09    450
9 2022-01-10    500

In [34]:
def Moving_average(df9):
    df9.sort_values('Date',inplace=True)
    df9['Moving_Average'] = df9['Sales'].rolling(window=7,min_periods=1).mean()
    return df9

In [35]:
Moving_avg = Moving_average(df9)
Moving_avg

        Date  Sales  Moving_Average
0 2022-01-01    100      100.000000
1 2022-01-02    150      125.000000
2 2022-01-03    200      150.000000
3 2022-01-04    180      157.500000
4 2022-01-05    250      176.000000
5 2022-01-06    300      196.666667
6 2022-01-07    350      218.571429
7 2022-01-08    400      261.428571
8 2022-01-09    450      304.285714
9 2022-01-10    500      347.142857

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [36]:
df10 = pd.DataFrame({'Date' : pd.date_range(start = '2023-01-01' ,end  =  '2023-01-5')})

In [37]:
df10

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [38]:
def add_weekday_column(df10):
    # Convert 'Date' column to datetime format
    df10['Date'] = pd.to_datetime(df10['Date'])
    
    # Add 'Weekday' column with weekday name
    df10['Weekday'] = df10['Date'].dt.day_name()
    
    return df10

In [39]:
weekday =add_weekday_column (df10)
weekday

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [40]:
def filter_date_range(df):
    # Convert 'Date' column to datetime type
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Filter rows based on date range
    filtered_df = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    
    return filtered_df

In [41]:
# Create a sample DataFrame
df = pd.DataFrame({'Date': pd.date_range(start='2023-01-01', end='2023-02-28', freq='D')})

# Call the function to filter the date range
filtered_df = filter_date_range(df)

# Display the filtered DataFrame
print(filtered_df)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?